{
        "scenario_type": "static",
		"map_path": "map_valley_terrain.png",
        "size": [600, 600],
        "narration": [
			"\"That's enough, Sergeant!\" Davis exclaimed, walking up in front of the older man. \"We can't waste any more time.\"",
			"Piper stood and grabbed his entrenching tool with his right hand. The sergeant stood perfectly still, glaring back at his commanding officer.",
			"The sun burned hot, and a slight breeze blew dust into the faces of the soldiers as they struggled to break into the earth with picks and shovels. Davis and Piper stood like boxers in a ring, only a few inches apart, glaring at each other.",
			"\"After all the work we've done here, I think we would be stupid to abandon this position, sir,\" Piper blurted out defiantly.",
			"\"Look, Piper,\" Davis said in hushed tones, not wanting the entire platoon in on the fracas, \"we've got to learn to work together, or we're going to get the hell shot out of us for sure. I'm willing to listen.\"",
			"Private First Class Cowper stopped digging to watch the argu- ment. The rest of the platoon, sensing the tension, slowly turned their gaze toward their two leaders.",
			"Davis knelt down and pointed to the map on the ground.",
			"\"Look, Sergeant, I know you were leading this platoon while I was still a cadet at West Point,\" Davis commented dryly as he searched for the right words. \"But I'm not sure that we-\"",
			"Piper cut him off with a mean scowl and a wave of his hand. \"Shit, Lieutenant, we're not talking about fighting the old Soviet 8th Guards Tank Army. These guys aren't eight feet tall. Hell, they ain't even four feet tall. I've fought these ragheads before and they don't like to fight. They won't attack a strong position and they'll never get over this tank ditch. It's too deep for tanks or BMPs to cross. If they come, we'll slaughter them with antitank, machine-gun, and rifle fire as they try to cross the ditch.\"",
			"\"I don't know .. .\" Davis said, looking toward the excellent tank country that made up the enemy's approach into Wadi AI Sirree.",
			"\"You're right that we don't have time to argue, Lieutenant. We should be digging in our positions and laying mines.\"",
			"The desert was quiet. The soldiers put down their shovels and watched the confrontation between their platoon leader and platoon sergeant.",
			"Damn it! Davis raged inwardly. I just arrived in the unit. My com- pany commander is about as friendly as my plebe calculus instructor, and my platoon sergeant is convinced that I couldn't lead a platoon to the latrine! In a few hours we could be fighting for our lives. I have to make the right decision. But what should I do?",
			"Davis could hear his own breathing. His stomach churned in knots and his heart was beating fast. He turned away from the platoon ser- geant and gazed to the west. Maybe we could defend here if we got enough mines and wire to make it impossible for them to break through, he thought. Maybe...",
			"\"If we stay here, we're going to need more mines and wire to stop them at the ditch,\" Davis suggested hesitatingly.",
			"\"Now you're talking, Lieutenant,\" Piper said with a grin. \"If we reinforce our positions to protect us from their artillery, and if we can place more mines and wire on both sides of the antitank ditch, we could hold off an army from here.\"",
			"Piper kicked the ground with his sand-colored boot, sending a clod of hard desert dirt into his foxhole.",
			"\"Believe me,\" he said confidently, \"you just leave it to me. This place will be as tight as a stone castle when we're through with it.\"",
			"\"How many mines do you think it will take?\" Davis asked.",
			"\"We'll need about one or two hundred. We'll have to work all night,\" Piper replied without emotion.",
			"\"OK, Piper,\" Davis replied quietly, looking down. He took off his helmet, sat down next to his half-dug hole, and took an olive-drab cloth bandanna from his pants cargo pocket. Slowly he opened his canteen, soaked the rag with water, and wiped his face. Refreshed, he suddenly knew that he was right to compromise with his sergeant. \"We'll do it. We'll dig in here. But only if it's a team effort. We start working together now or no deal.\"",
			"Piper smiled and extended his hand. \"You got it, Lieutenant. Trust me. Leadership involves compromise. I know what I'm doing.\"",
			"Davis took the sergeant's hand and grinned.",
			"The soldiers on the hill watched the two men shake hands and went back to their digging. The infantrymen were too preoccupied with their own troubles to care about their green lieutenant.",
			"\"Shit,\" Piper said, beaming, as he shook the lieutenant's hand. \"This will be over in a couple of days and we'll all be headed home.\"",
			"\"Sure. It's all been happening so fast,\" Davis said with a bleak smile. \"I've just arrived. The lives of our men depend on what we decide. I know I still have a lot to learn.\"",
			"\"Lieutenant, you're gonna be fine. We'll get through this OK if you listen to me.\"",
			"Davis stood motionless, relieved that the decision had been made. He felt as if a great burden had been lifted from his shoulders.",
			"\"Look, I don't claim to have all the answers. I just know that we can stop the enemy here. The success or failure of our defense will depend upon the use of our weapons, the ground, and our prepara- tions. We have to consider the range of our weapons, dead space, the mixture of flat trajectory and high-angle fires, antiarmor and antipersonnel fires, and barriers and mines. If we do these things correctly, we can accomplish our mission and keep our people alive.\"",
			"\"Right,\" Davis answered in a tone between triumph and embar- rassment. \"I know one thing for sure. We'll do a better job now that we're working as a team.\"",
			"\"I couldn't agree more,\" Piper said with a wry grin. \"Here's what I recommend. I'll supervise the sighting of the weapons, get every- one making range cards, and inspect the fighting positions. You can make up a plan to lay more minefields to reinforce the tank ditch. I'1l have a detail ready to lay mines in three hours.\"",
			"Davis nodded his head in agreement. \"How are we going to do this?\" he asked.",
			"Piper looked to the west, scanning the terrain for avenues of at- tack. \"I know how these guys fight. If we show them a strong hand- I mean really block the openings to Wadi Al Sirree with obstacles- they'll avoid us and go some other way. If they're stupid enough to attack us along Axis Cobra, we can kill them at the tank ditch. If they come our way, they've got to come across the ditch.\"",
			"\"Right. We'll have to lay mines at both ends of the ditch,\" Davis said in a determined, serious voice, \"to deny movement through the ground where the ditch ends. We could even put some mines inside the ditch, in case they get into it.\"",
			"\"Yeah,\" Piper replied, his cunning smile broadening. His expres- sion was that of a hunter, preparing to capture his prey. \"We'll set concertina wire and mines where the ditch ends. That will tempt the enemy to avoid the wire and entice him to try to breach the tank ditch.\"",
			"\"Let's hope that doesn't happen,\" Davis said.",
			"\"Don't worry. It shouldn't. You said yourself that the old man doesn't think they'll come this way. My guess is that they'll send a small probing attack. Probably no more than a platoon or so. When they come, we'll be waiting for them. They'll never get past the friggin' ditch.\"",
			"\"I wish we had some .50-caliber machine guns,\" Davis added.",
			"\"Hell, Lieutenant, I'd give away an R and R in Bahrain with two belly dancers for the taste of a fifty.\"",
			"Davis and Piper burst out laughing, happy that they were finally working together. \"The FO and I will complete a target list to support the defense. I'll prepare the platoon operations order,\" Davis an- nounced after a moment.",
			"\"I'1] have Mizogouchi get a detail together to carry our barrier material and mines into position,\" Piper said. \"It looks like we'll be better off working through the night and sleeping in the day.\"",
			"\"Yes,\" Davis answered, somewhat overwhelmed by the magnitude of the task ahead of him. \"I guess we should.\"",
			"Davis reached for the canteen on his left hip, found it empty, and unbuttoned the flap on the cover of his right canteen. Barely a quar- ter of the contents were left. He unscrewed the plastic top and drank the last drop of warm, precious liquid. He made a mental note to check into the water situation when he got back to the platoon.",
			"<blockquote>He whose ranks are united in purpose will be victorious. -- Sun Tzu</blockquote>",
			"Davis had fought the first important battle of his young career. Now, he mused, had he won or lost?"
        ],
        "offensive_units": {},
        "defensive_units": {
			"d1": {"name": "Defend squad 1", "icon": "1-circle"}, 
			"d2": {"name": "Defend squad 2", "icon": "2-circle"}, 
			"d3": {"name": "Defend squad 3", "icon": "3-circle"}, 
			"d4": {"name": "Defend squad 4", "icon": "4-circle"}, 
			"d0": {"name": "Platoon HQ", "icon": "0-circle", "rank_icon": "star"}
		},
		"neutrals": {
			"defend_objective": {"name": "Defending Objective", "icon": "shield-fill-exclamation", "color": "blue"},
			"mine_m1": {"name": "Minefield M1", "icon": "dash-square-dotted", "color": "green"},
			"mine_m2": {"name": "Minefield M2", "icon": "dash-square-dotted", "color": "green"},
			"mine_m3": {"name": "Minefield M3", "icon": "dash-square-dotted", "color": "green"},
			"mine_m4": {"name": "Minefield M3", "icon": "dash-square-dotted", "color": "green"}
		},
        "offensive_color": "red",
        "defensive_color": "blue",
        "script": [
					{"d1": [361, 385, 100.0, "working"], "d2": [407, 367, 100.0, "working"], "d3": [494, 348, 100.0, "working"], "d4": [551, 312, 35.0, "working"], "d0": [430, 326, 35.0, "working"], 
					"defend_objective": [367, 105, null, "blink"], "mine_m1": [297, 429, null, "working"], "mine_m2": [374, 424, null, "working"], "mine_m3": [436, 419, null, "working"], "mine_m4": [557, 349, null, "working"]}
		]
}