{
        "scenario_type": "static",
        "narration": [
			"<h1 class=\"text-center\"> Captured </h1>",
			"\"Fire! Get the bastard!\"",
			"The Javelin gunner, his eye pressed against the command launch unit sight, depressed the firing trigger. The missile burst out of the tube in a loud roar and flew a jumping, erratic path to the stationary tank. The missile hit the turret and shot a molten stream of energy in- side. The tank ignited in a billow of smoke and flame as its ammu- nition exploded.",
			"A second tank behind the exploding hulk turned its turret toward Davis's position, eager to avenge the death of the lead vehicle. The tank fired its machine guns in a wide, wild arc as the turret turned. Machine-gun bullets ripped through the sandbags of Davis's fighting position.",
			"Davis watched as the Javelin gunner tried to jump to cover. A stream of bullets from the enemy tank cut the American down.",
			"Davis reached down inside his position and armed an AT4 antitank rocket. Quickly, while bullets whizzed by and splattered on his fight- ing position, he fired. The missile flew short and exploded against a rock, missing the intended target. The tank jerked to a halt, aimed its turret at Davis, and plastered his position with machine-gun bullets.",
			"Davis dove for cover. Several 7.62mm bullets pierced his left arm as he ducked, tearing the flesh and shattering the bone. Davis winced in pain. His arm hung limp, the open wounds gushing blood. He fought to get up, but the effort was futile. With his good arm he reached for the green bandanna he kept in the cargo pocket of his trousers and improvised a hasty tourniquet. He suddenly felt weak. The world began to spin, and in a few seconds Davis fell unconscious.",
			"The hot sun glared down on Davis as he opened his eyes. He felt pain all over, especially his left arm.",
			"He realized that he was in the back of an open truck, moving quickly down a bumpy desert road. He lay on the cold metal bed of the truck. Eisler was doing everything he could to hold his lieutenant down.",
			"\"Hold on, sir,\" pleaded Specialist Eisler, the platoon medic.",
			"\"What . . . what happened?\" Davis asked, realizing that something was wrong. Eisler wasn't wearing his helmet.",
			"\"We've been captured,\" Eisler reported with tears in his eyes. \"There's only a few of us left. They shot most of the wounded. They kept you alive when they found out you were an officer.\"",
			"Davis closed his eyes in pain."
        ],
        "mapless_mode": true
}