{
        "scenario_type": "random",
		"map_path": "map_valley_terrain.png",
        "size": [600, 600],
        "narration": [
			"Davis shook his head. \"Not yet. We have plenty of mines left to lay. They won't stop tanks unless we set and arm them.\"",
			"\"Yes, sir,\" Piper agreed. \"I guess this heat is getting to me. I'll tell the squad leaders that they can start their rest plans after all the minefields are laid. That'll keep 'em going.\"",
			"\"Good idea,\" the lieutenant replied with a grin. \"You can tell 'em that I'll be checking each fighting position this afternoon. The Jav- elin and machine-gun positions better be perfect.\"",
			"Piper smiled a weary smile and then shouted for the squad leaders, who slowly trudged over to him. Like a padre in church, Piper deliv- ered a sermon that was direct and full of fire and brimstone. After a few minutes Piper dismissed his loyal congregation, and the squad leaders, energized by the platoon sergeant's exhortations, scurried off to accomplish their tasks.",
			"The desert sun bore down on them, making each job difficult. The sweat-stained men moved about the position like zombies. Piper was everywhere, checking, cajoling, and inspecting. He verified the over- head cover by making two men jump on the roof of every fighting position. If the cover didn't hold the weight of two men, it wouldn't be much protection against enemy artillery.",
			"Sergeant Piper walked carefully over to Davis's fighting position. Davis was sitting outside his hole, watching the last stages of the sunset.",
			"\"The squads have completed their positions,\" Piper announced. \"We have a few more mines to lay, but all in all, we're ready.\"",
			"\"I've been thinking about tomorrow,\" Davis said, looking up at his platoon sergeant. Piper kneeled down on one knee.",
			"\"Shoot, Lieutenant, what's on your mind?\"",
			"\"Are we sure that we can stop the enemy from infiltrating into our sector?\" Davis questioned. \"Can we block him in this valley if he decides to attack down Axis Cobra? Have we put up enough mines and wire?\"",
			"\"Don't get the jitters now, sir,\" Piper said with a broad smile. \"All we have to do is stop them at the tank ditch. We'll be fine. Trust me.\"",
			"<blockquote>An obstacle loses 50 per cent of its value if you stand back from it, allowing the enemy to reconnoiter the approaches and subsequently to cross without interference. -- Field Marshal Sir Bernard L. Montgomery</blockquote>",
			"\"Sure, you're right,\" Davis said, nodding his head.",
			"\"We're almost ready,\" Piper insisted. \"This is turning into a text- book position. We've laid out our weapons to cover the dead space and every approach into the valley. It took a lot of work, but we've dug nineteen two-soldier fighting positions, each position with a corrugated steel roof, reinforced with rocks and four layers of sand- bags. We have open firing ports dug into the flanks of every bunker for antitank weapons to fire to the front and the oblique.\"",
			"\"On top of that we laid more mines and barbed wire than I can count,\" Davis added. \"I don't know what's bugging me. I guess I'm just a little nervous.\"",
			"\"We all are, sir. Don't worry, you'll do fine, just fine. Well, I better troop the line and make some last-minute checks with the squad lead- ers. I'll order them to execute a sleep plan and rotate the men's duties between sleeping, working, and security. We still have jobs to do.\"",
			"Piper walked off into the dark. Davis settled into his fighting po- sition. Cowper sat patiently nearby, ready to offer his lieutenant the radio handset at the first sign of trouble.",
			"The night hours passed slowly, uneventfully. The company radio net was filled with routine reports, interrupted by a few intelligence updates that were passed over the company command net by the company XO.",
			"Hell, I wish I'd thought of digging some craw] trenches between our positions, Davis reflected. Then again, in this rocky soil such a task would have taken us forever.",
			"During the night, the sky far to the west, behind the jagged ridge, was lit up by the bright flash of explosions and the eerie glow of artillery flares. Davis was tense with anticipation but relieved to know that the flashes to the west were still far away.",
			"\"One-Four, this is One-Six,\" Davis whispered into the transmitter of his radio. \"Do you see anything?\"",
			"\"Negative. Don't worry, One-Six, I don't think they'll attack at night,\" Piper replied with the quiet confidence of a veteran soldier. \"They'll probably sign a cease-fire agreement tomorrow, anyway.\"",
			"Maybe Piper's right, Davis thought. Hell, once they find out they're up against the United States, they'll probably head for home.",
			"The night wore on without incident. The reports sent over the ra- dio remained routine. Davis lay down with the receiver of Cowper's radio pressed to his ear.",
			"\"One-Six, this is One-Three. Over,\" an excited Sergeant Mizo- gouchi announced over his squad radio to the platoon leader.",
			"\"This is One-Six. Send it. Over,\" Davis replied.",
			"\"I hear helicopters. They sound pretty far away,\" Mizogouchi reported.",
			"\"Can you tell where they are? Do you see them? Over.\"",
			"\"Not sure. The sound is off to the southwest. Over.\"",
			"Davis paused before answering. Damn, I wish he could have seen those helicopters, Davis thought. Where did they go? Was it a troop- carrying helicopter or a scout? Ours or theirs? Hell, they're probably friendly and nobody told us they were in the area. Mizogouchi is just jumpy. He's hearing things again, like last night.",
			"\"The sound's gone now,\" Mizogouchi added.",
			"\"Call me if you sight anything. Out,\" Davis ordered.",
			"The hours passed. At 0300 the rumble of distant artillery foretold that the time of battle was drawing near. Suddenly Davis heard the distinct crack of grenades and machine guns to the east.",
			"\"Cowper, get company headquarters on the radio.\"",
			"Cowper tried in vain for several minutes to call Captain Bludgell. \"Sir, I can't get anyone on the radio. I think we're being jammed.\"",
			"Why can't I reach the company commander? Davis contemplated the consequences of this event. Could the enemy be attacking in our rear? Had they conducted an air assault? If so, why did they leave me alone?",
			"The night sky faded into a light shade of gray. The sound of battle in the east rose to a crescendo. The sky near BP Bravo was illumi- nated by tracers and explosions.",
			"The tension mounted. The noise of artillery started again. The sounds of big guns and rockets pounding the ground could be heard now to the west. The steady drumbeat of artillery shells grew omi- nously nearer with each passing minute.",
			"It doesn't look like the enemy was eager to sign a cease-fire, Davis thought. Every indication is that combat is imminent. I can sense that the men are nervous. Fear is in the air. You can't see it or smell it, but it's there, as real as if it were made of flesh and blood.",
			"Billows of black smoke could be seen on the western horizon. Davis put down his night-vision goggles and trained his binoculars in the direction that he expected the enemy armor to advance. The ground to the west of BP Alamo sloped downward for four kilome- ters, then gradually rose for an additional four kilometers to a jagged ridge on the western horizon. Between BP Alamo and this ridge was nothing but empty desert. As the enemy approached from the west, he would have to cross this open space against the brigade's deep fires. Unfortunately, Davis knew how weak those deep fires were: only one battalion of 155mm artillery and a few sorties from navy F/A-18s and air force A-10s. The carrier-based F/A-18s had a short loiter time because of the distance of the battlefield from the aircraft carrier that they called home. The A-10s, on the other hand, could stay longer because they were from an allied air base forty kilome- ters to the south. The A-10s, potent tank killers, had the disadvantage of being old, big, and slow. With the improvements in air defense systems in the past years, the A-10's survivability was always a mat- ter of pilot skill and luck.",
			"Maybe the enemy won't attack through my valley, Davis thought.",
			"A flight of F/A-18s screamed overhead, flying low over Wadi Al Sirree. The aircraft headed west to attack the advancing enemy columns.",
			"\"Sir, 've been eavesdropping on the artillery net,\" Sergeant Mark reported. \"All the long-range stuff is engaging the enemy. We'II be in battle with the main force soon.\"",
			"The sound of outgoing 155mm artillery shells punctuated Mark's words. The rounds arced high overhead and exploded to the west, detonating with a rumble that shook the ground in Wadi Al Sirree. A pair of F/A-18s roared across the sky to the north, dropping cluster bombs on the advancing enemy armor.",
			"I hope the brigade punches the hell out of them, Davis thought. We need every chance we can to even these odds.",
			"<blockquote>In offensive and defensive tactical actions, commanders fight the enemy throughout the depth of his disposition with fires and with attacks on his flanks and rear. They attack committed and uncommitted forces and synchronize the attack of enemy artillery in depth with close operations. Such in-depth operations degrade the enemy's freedom of action, reduce his flexibility and endurance, and upset his plans and coordination. -- FM 100-5, Operations, 1993</blockquote>",
			"The sound of multiple explosions resonated from the area beyond the jagged ridge to the west.",
			"\"That's our stuff,\" Davis shouted to his men. \"Get ready. The en- emy will be on us in about twenty minutes.\"",
			"Davis focused his binoculars on the exits of the jagged ridge, eight kilometers to the west. The passes were filled with dust and smoke. Suddenly, dark objects began racing out of each pass. Then scores of vehicles, moving in high-speed columns, quickly exited the narrow defiles and raced east across the broken desert terrain.",
			"\"There they are,\" Davis declared, pointing to the distant ridge. Sergeant Mark gave his lieutenant a worried look, then put the radio receiver back to his ear and continued eavesdropping on the artillery radio frequency.",
			"The rumble of explosions increased. The detonations sounded like the strike of a huge hammer, pounding the earth to the northwest. Davis watched with silent satisfaction as one of the lead enemy col- umns was blanketed with the impact of cluster bombs and 155mm artillery shells. A number of vehicles in this column were struck by bomblets and burst into flame. More vehicles, however, bypassed the wreckage and continued on their determined path to the east.",
			"American planes darted above the advancing enemy formations. A volley of antiaircraft missiles greeted the attacking aircraft. A fiery explosion registered the midair destruction of one of the F/A-18s. Several other aircraft, having already dropped their ordnance, ignited their afterburners and roared back to the east, attempting to outrun the enemy's effective missile defenses.",
			"The sound of outgoing artillery shells suddenly died. The battle- field grew ominously quiet. Our deep operation is over, Davis thought. Now it's the enemy's turn.",
			"\"That's it, sir,\" Mark announced, confirming Davis's suspicions. \"The F/A-18s are heading home. We may get some A-10s later. We'll get fires only if we can target a large formation of armored vehicles.\"",
			"Every man faced to the west, watching the enemy columns get closer. The sound of bursting artillery, pounding a steady path from west to east, interrupted this short interlude of quiet. The explosions moved with precision in an inexorable wall of exploding steel toward the American positions.",
			"Balls of orange flame erupted in the openings to the trails on the western edge of Wadi Al Sirree. The earth shook under the thunder of the enemy's 152mm guns. The bursting artillery shells showered the American positions with rocks and dirt.",
			"\"Shit, here it is. Incoming!\" Cowper screamed as he dove for the bottom of his fighting position.",
			"A storm of fire exploded over BP Alamo. The shelling rose in in- tensity to a deafening roar as the earth exploded in fire and smoke. With a flash of crimson, one round after another roared in on the defenders. Engulfed in fire and flying steel, BP Alamo became a burning charnel house.",
			"Davis looked to the west over the parapet of his fighting postions. The shelling was too precise, he thought. It was as if the enemy had an observer targeting each fighting position."
        ],
        "offensive_units": {
			"ob0": {"name": "Enemy artillery fire", "icon": "patch-exclamation"}, 
			"ob1": {"name": "Enemy artillery fire", "icon": "patch-exclamation"},
			"ob2": {"name": "Enemy artillery fire", "icon": "patch-exclamation"},
			"ob3": {"name": "Enemy artillery fire", "icon": "patch-exclamation"},
			"ob4": {"name": "Enemy artillery fire", "icon": "patch-exclamation"},
			"ob5": {"name": "Enemy artillery fire", "icon": "patch-exclamation"},
			"ob6": {"name": "Enemy artillery fire", "icon": "patch-exclamation"},
			"ob7": {"name": "Enemy artillery fire", "icon": "patch-exclamation"},
			"ob8": {"name": "Enemy artillery fire", "icon": "patch-exclamation"},
			"ob9": {"name": "Enemy artillery fire", "icon": "patch-exclamation"}
		},
        "defensive_units": {
			"d1": {"name": "Defend squad 1", "icon": "1-circle"}, 
			"d2": {"name": "Defend squad 2", "icon": "2-circle"}, 
			"d3": {"name": "Defend squad 3", "icon": "3-circle"}, 
			"d4": {"name": "Defend squad 4", "icon": "4-circle"}, 
			"d0": {"name": "Platoon HQ", "icon": "0-circle", "rank_icon": "star"}
		},
		"neutrals": {
			"defend_objective": {"name": "Defending Objective", "icon": "shield-fill-exclamation", "color": "blue"},
			"mine_m1": {"name": "Minefield M1", "icon": "dash-square-dotted", "color": "green"},
			"mine_m2": {"name": "Minefield M2", "icon": "dash-square-dotted", "color": "green"},
			"mine_m3": {"name": "Minefield M3", "icon": "dash-square-dotted", "color": "green"},
			"mine_m4": {"name": "Minefield M3", "icon": "dash-square-dotted", "color": "green"}
		},
        "offensive_color": "red",
        "defensive_color": "blue",
        "script": [
			{
				"d1": [361, 385, 100.0, "hide"], "ob2": [361, 405, 100.0, "inactive"], "ob3": [351, 375, 100.0, "inactive"],
				"d2": [407, 367, 100.0, "hide"], "ob4": [417, 357, 100.0, "inactive"], "ob5": [387, 367, 100.0, "inactive"],
				"d3": [494, 348, 100.0, "hide"], "ob6": [494, 368, 100.0, "inactive"], "ob7": [474, 368, 100.0, "inactive"], 
				"d4": [551, 312, 100.0, "hide"], "ob8": [531, 312, 100.0, "inactive"], "ob9": [551, 332, 100.0, "inactive"], 
				"d0": [430, 326, 35.0, "hide"],  "ob0": [415, 326, 100.0, "inactive"], "ob1": [423, 319, 100.0, "inactive"], 
			"defend_objective": [367, 105, null, "blink"], "hill_865": [291, 300, null, "active"], "mine_m1": [297, 429, null, "active"], "mine_m2": [374, 424, null, "active"], "mine_m3": [436, 419, null, "active"], "mine_m4": [557, 349, null, "active"]},
			{
				"ob2": [361, 405, 100.0, "blink"], "ob3": [351, 375, 100.0, "inactive"], "ob4": [417, 357, 100.0, "blink"], "ob5": [387, 367, 100.0, "inactive"], "ob6": [494, 368, 100.0, "blink"], "ob7": [474, 368, 100.0, "inactive"], "ob8": [531, 312, 100.0, "blink"], "ob9": [551, 332, 100.0, "inactive"], "ob0": [415, 326, 100.0, "blink"], "ob1": [423, 319, 100.0, "inactive"]
			},
			{
				"ob2": [361, 405, 100.0, "inactive"], "ob3": [351, 375, 100.0, "blink"], "ob4": [417, 357, 100.0, "inactive"], "ob5": [387, 367, 100.0, "blink"], "ob6": [494, 368, 100.0, "inactive"], "ob7": [474, 368, 100.0, "blink"], "ob8": [531, 312, 100.0, "inactive"], "ob9": [551, 332, 100.0, "blink"], "ob0": [415, 326, 100.0, "inactive"], "ob1": [423, 319, 100.0, "blink"]
			},
			{
				"ob2": [361, 405, 100.0, "blink"], "ob3": [351, 375, 100.0, "inactive"], "ob4": [417, 357, 100.0, "blink"], "ob5": [387, 367, 100.0, "inactive"], "ob6": [494, 368, 100.0, "blink"], "ob7": [474, 368, 100.0, "inactive"], "ob8": [531, 312, 100.0, "blink"], "ob9": [551, 332, 100.0, "inactive"], "ob0": [415, 326, 100.0, "blink"], "ob1": [423, 319, 100.0, "inactive"]
			},
			{
				"ob2": [361, 405, 100.0, "inactive"], "ob3": [351, 375, 100.0, "blink"], "ob4": [417, 357, 100.0, "inactive"], "ob5": [387, 367, 100.0, "blink"], "ob6": [494, 368, 100.0, "inactive"], "ob7": [474, 368, 100.0, "blink"], "ob8": [531, 312, 100.0, "inactive"], "ob9": [551, 332, 100.0, "blink"], "ob0": [415, 326, 100.0, "inactive"], "ob1": [423, 319, 100.0, "blink"]
			}
		],
        "choices": [
            [50, "result_arty_direct_hit"],
            [25, "result_captured"],
			[25, "result_survive"]
        ]
}