{
        "scenario_type": "static",
        "narration": [
			"<h1 class=\"text-center\"> Captured </h1>",
			"The ground trembled with the bursting enemy shells. The artillery fire was extremely accurate, Davis thought. Too accurate. He felt like an ant, getting ready to be stepped on.",
			"\"Shit, they must have an observation post that is calling artillery fire in on us!\" Davis screamed as a powerful 152mm round de- stroyed the Javelin position to his right flank. The U.S. positions were being taken out one at a time. Too few enemy shells were land- ing to indicate a normal artillery barrage.",
			"Could they be using precision-guided artillery shells? Davis wondered.",
			"Davis watched in horror as the second Javelin position was smashed by a pinpoint explosion. Suddenly a flash of fire and steel engulfed Davis's fighting position. The force of the impact of the enemy shell collapsed the overhead cover and buried the lieutenant in sand and rock.",
			"Davis hit hard against the earth. He felt numb all over, then he blacked out.",
			"When he finally opened his eyes, he saw that he was covered with sand and blood. It took a few moments before he realized that he was still with the living. As he began to move his limbs he discovered that his legs were crushed under the weight of the roof's sandbags. He recoiled in horror as he saw that Cowper's bloodied and mangled body had taken most of the impact of the artillery blast.",
			"Flies buzzed everywhere. Davis was numb and sick. His mouth had a coppery red-blood taste. He tried to move rocks and pieces of metal off his legs. He couldn't seem to focus his eyes. He struggled to look at his watch.",
			"There were people walking around him. Someone was shouting.",
			"He waved his hands. \"Help me!\"",
			"In seconds he was surrounded by enemy soldiers. They dragged him up out of the hole and raised him to his feet. Davis struggled to stand but his legs failed him and he fell to the ground. The enemy soldiers shouted at him and kicked him. Davis recoiled from the blows, using his right arm to guard his face.",
			"Suddenly someone, sounding very official, barked commands in a language Davis couldn't understand. The kicking stopped. Hands reached down and jerked him up. Davis screamed in pain.",
			"The next thing he knew he was lying on the back of a truck, bouncing down a rough desert trail. A mean-looking guard, brandish- ing an AK-74 assault rifle, sat near the tailgate of the truck. The guard's eyes were filled with hatred as he stared at Davis.",
			"Lieutenant Bruce Davis was now a prisoner of war. <b>He had failed in his mission.</b> Every soldier in his platoon was either dead or cap- tured. The enemy had broken through Wadi Al Sirree and driven the Americans to the east."
        ],
        "mapless_mode": true
}