{
        "scenario_type": "static",
        "narration": [
			"\"Here we go again. Incoming!\" Cowper yelled. \"Take cover.\"",
			"The ground in front of Davis erupted with exploding shells and searing metal, throwing him back to the bottom of his hole. Davis rose up to survey the damage. Sergeant Mark's hole, thirty meters from Davis's position, had taken a direct hit and was nothing more than a smoldering black void. Davis could see no sign of his forward observer or Hutchinson.",
			"Cowper cowered low in the hole, next to his platoon leader. The RTO strained to hear the radio, pressing the receiver hard against his ear. Dirt was falling all over them. Dust filled the air, entering Davis's mouth and nose, filling his lungs. It was almost impossible to breathe.",
			"Davis crouched back into his hole. He grabbed the hand mike from Cowper. The sound of artillery, pounding a steady path from west to east, filled the air. The ground trembled. Enemy artillery whistled overhead.",
			"\"Cowper,\" Davis exclaimed. \"Change frequencies. Find the 155mm artillery battalion's frequency. Get them on the line for me, ASAP.\"",
			"Cowper pulled the radio closer to read the frequency window. He read the 155mm artillery battalion frequency from the plastic wrist coder on his left forearm.",
			"\"Set, sir,\" Cowper yelled over the bursting shells. \"Victor Seven- Six, this is Bravo One-Six Alpha.\"",
			"Davis surveyed the scene. Enemy tanks and BMPs were scattered in front of the tank ditch, squirming and struggling to find a way across the obstacle. A huge explosion near the tank ditch sent parts of a tank high into the air. Thick black smoke billowed to the sky. Another enemy tank had become a victim of a well-placed antitank mine.",
			"\"Sir, we've got them,\" Cowper screamed with joy.",
			"Machine-gun bullets raked the top of Davis's position, throwing dirt and rocks into the hole. Both men ducked lower. Davis grabbed the receiver.",
			"\"This is Bravo One-Six. The enemy is attacking along Cobra. I've got at least twenty vehicles west of the tank ditch now!\"",
			"\"Identify yourself,\" came the answer over the radio receiver.",
			"\"Damn it!\" Davis pulled up Cowper's arm to observe the wrist coder on his left forearm. He read the self-authentication tables. \"I self-authenticate Alpha Kilo November. Now, damn it! Fire for ef- fect, target Bravo One-Zero-Four, four tanks. Over.\"",
			"Soon, Davis had the artillery falling at Bravo One-Zero-Four.",
			"\"Lieutenant, keep it up. You're right on target,\" Cowper yelled as he observed the engagement area.",
			"Davis sat in the bottom of the hole, his Kevlar helmet tilted on his head and the hand mike pressed hard against his ear. His ears were ringing from the noise of the artillery shells, but he heard Cowper's shouts and grinned.",
			"The sound of U.S. 155mm artillery filled the air as the shells smashed into Bravo One-Zero-Four. Davis quickly shifted fires onto other enemy targets.",
			"\"Cowper, take the hand mike.\" Cowper traded places with his lieutenant. The American artillery continued pounding the enemy.",
			"\"We're hitting them. Keep firing,\" Davis yelled to Cowper. The lieutenant bravely observed the fires from the opening in his posi- tion. He could see black smoke rising high in the sky from the im- pact of the rounds.",
			"\"DPICM in effect,\" he shouted.",
			"The artillery tore apart several vehicles, but the remainder of the attackers kept moving, forcing their way through the ditch. A firing line of enemy tanks engaged BP Alamo with continuous fire. Enemy machine-gun tracers and tank cannon blasted the American positions on the hill east of the tank ditch.",
			"Bullets bounced off the rocks and tore the sandbags of Davis's fighting position to shreds. Davis ducked, too slowly. A bullet struck him in the head. His body jerked back violently and fell in a heap at the bottom of the fighting position. He emitted no words, no sounds. A 12.7mm round from a tank-mounted machine gun had pierced his Kevlar helmet and ended his life."
        ],
        "mapless_mode": true
}