{
        "scenario_type": "random",
		"map_path": "map_valley_terrain.png",
        "size": [600, 600],
        "narration": [
			"\"Negative. We still have too much to do,\" Davis announced authorita- tively. \"Get everyone up and working. We've got to finish the mine- fields and lay more barbed wire.\"",
			"Piper looked down and kicked a rock at his feet. \"OK. Whatever you say, Lieutenant.\"",
			"The infantrymen obediently left their fighting positions to lay wire, place and arm antitank mines, and fill sandbags. The soldiers worked, sweat stained and thirsty, in the hot desert sun. In spite of their bests efforts, they didn't have time to lay the concertina wire in three strands, with the standard layer of two rolls on the bottom and one on top. As a compromise they laid single rows of concertina wire on the west side of the tank ditch.",
			"Piper was everywhere, cajoling and inspecting. He verified the overhead cover on every fighting position by making two men jump on top of each roof. If the position didn't hold the weight of two men, it wouldn't be much protection against enemy artillery. As evening fell, the squads rotated duties between sleeping, working, and security.",
			"Davis felt confident. The platoon had worked effectively in the past twenty hours, and he was satisfied with the relationship he had developed with Sergeant Piper. BP Alamo wasn't as ready as he would have liked, but at least the platoon was dug in with overhead cover. Each two-soldier fighting position was three to four feet deep. The corrugated steel roofs were reinforced with rocks and several layers of sandbags. Each position provided its occupants reasonable protection to the front and overhead, while still allowing fire to the front and the oblique.",
			"Hell, I wish I'd had time to put in more mines and wire, Davis swore to himself. I also wish I could have dug some crawl trenches between our positions.",
			"The night was spent in work and worry. The company radio net was filled with routine reports, interrupted only by a few intelligence updates from battalion that were passed over the command net by the company XO.",
			"Maybe they'll attack at midnight tonight. Yes, they'll probably come at midnight, Davis thought.",
			"Around midnight, the sky to the west was lit up by the bright flash of explosions and the eerie glow of artillery flares. The sounds of big guns and rockets pounded the ground far to the west.",
			"\"One-Four, this is One-Six,\" Davis whispered into the transmitter of his radio. \"Do you see anything?\"",
			"\"Negative. Don't worry, One-Six, they won't attack at night,\" Piper replied with the confidence of a veteran soldier.",
			"You're scaring yourself for nothing, Davis thought. Piper's prob- ably right. Maybe they won't attack tonight. Hell, once they find out they're up against the United States, they'Il probably head for home.",
			"At 0330 Davis settled into his position, hoping for a few min- utes' rest. God, I'm tired! Davis thought. He leaned against the dirt wall, with the receiver of Cowper's radio pressed to his ear. The bright full moon sank slowly over the western horizon. Now only starlight illuminated the desert night.",
			"\"One-Six, this is One-Three. Over,\" an excited Sergeant Mizo- gouchi transmitted over his squad radio to the platoon leader.",
			"\"This is One-Six. Send it. Over,\" Davis replied.",
			"\"One-Six, I hear helicopters in the distance,\" Mizogouchi reported.",
			"\"Can you tell where they are? Do you see them? Over.\"",
			"\"Not sure. They sounded like they were to my south. The sound's gone now. Over.\"",
			"Davis crawled out of his fighting position, stood up, and took off his helmet. He listened intently to the hum of the rotors from the southwest. It sounded like a group of helicopters was flying east around the large mountain to the south. Davis jumped back down to the radio and grabbed the handset.",
			"\"Can you tell whether they're friendly or enemy?\" Davis asked, his voice pressed with urgency. \"I've got to know where they're headed.\"",
			"\"Unknown,\" Mizogouchi replied, sounding embarrassed. \"I can't see them.\"",
			"Damn, I wish we could have seen those helicopters, Davis thought. Where did they go? Were they troop-carrying helicopters or scouts?",
			"Ours or theirs? Hell, they're probably friendly and nobody bothered to tell me.",
			"\"Keep looking and call me if you sight anything. Out,\" Davis or- dered. He switched the frequency and relayed the report of helicop- ters to Captain Bludgell with the caveat that they were probably American.",
			"\"Call me back when you can tell me for sure what's happening. I can't react to noises in the dark. Out,\" Bludgell replied curtly.",
			"Suddenly to the east Davis heard the sound of small-arms fire, the thump of grenades, and the crash of muffled explosions.",
			"\"One-Six, this is One-Four. Sounds like there's a battle going on near BP Bravo.\"",
			"\"Roger, One-Four,\" Davis answered Piper apprehensively. \"Stand by. I'll find out what's happening.\" Davis quickly changed radio frequencies.",
			"\"Bravo One-Six, this is Bravo Six-Six Alpha,\" Captain Bludgell's radioman announced over the radio receiver.",
			"\"This is One-Six. What the hell's happening? Over.\"",
			"\"We're under attack by enemy infantry. The CO's been hit and we lost the mortars. Sergeant Rossetti is in charge. I can't find the XO.\"",
			"\"Can you hold?\" Davis asked, surprised at this unexpected turn of events. He could hear the sound of machine-gun fire in the back- ground of Six-Six Alpha's transmission.",
			"\"The shit here is really bad. The enemy is all over the place. Can you help us?\"",
			"The radio suddenly went silent.",
			"\"Six-Six Alpha, this is One-Six. Over,\" Davis repeated, trying to reestablish contact. \"Six-Six Alpha, this is One-Six. Over.\"",
			"\"Sir, I've lost contact too,\" Sergeant Mark complained. \"I've tried all our frequencies. The only stations I can reach are in the platoon.\"",
			"\"Cowper, check out the radio,\" Davis ordered. \"Check the antenna.\"",
			"\"I've already done that, sir. It's OK,\" Mark said.",
			"\"Sir, I can't reach anyone on the company net,\" Cowper said, his voice edged with worry. \"They're not transmitting.\"",
			"The clamor of the battle at BP Bravo echoed through the valley. Slowly the sounds of fighting from the east diminished, then stopped altogether. Davis took the handset from Cowper and quickly changed to the platoon frequency.",
			"\"One-Four, this is One-Six,\" Davis reported calmly over the pla- toon radio frequency to Piper. \"Those helicopters that One-Three heard must have been enemy. They must have circled around the mountain to the south and landed some infantry behind BP Bravo.\"",
			"\"One-Six, what are we going to do now?\" Piper asked. \"Can you reach company or battalion?\"",
			"Davis considered his options. Why can't I reach the company? Could the enemy have destroyed everyone on BP Bravo? If so, why did they leave me alone? What if the enemy destroyed Bludgell and was now turning on me?",
			"\"Negative. I've tried several times.\" Davis paused, recognizing the hard truth of his platoon's situation. \"We're on our own. There's nothing we can do for the company now. Just keep an eye out for any enemy who may come our way down the valley from the east. Con- tinue the mission as planned.\"",
			"The night sky faded into a light shade of gray. The tension mounted as dawn arrived. A steady drumbeat of distant artillery shells grew nearer.",
			"The situation looks grim, Davis thought. The enemy has probably taken BP Bravo. Had enemy air assaults also disrupted the U.S. artillery?",
			"Billows of black smoke could be seen on the western horizon. The lieutenant put down his night-vision goggles and scanned to the west with his binoculars. He trained them in the direction that he expected the enemy armor to advance.",
			"The ground to the northwest of BP Alamo sloped downward for four kilometers, then gradually rose for an additional four kilometers to a jagged ridge on the western horizon. Between BP Alamo and this ridge was nothing but empty desert. As the enemy approached from the west, he would have to cross this open space against the brigade's deep fires. Unfortunately, Davis knew how weak those deep fires were-only one battalion of 155mm artillery and a few sorties from navy F/A-18s and air force A-10s.",
			"Piper ran over to Davis's position. \"Things don't sound so good,\" Piper said, taking a moment to catch his breath. \"If the enemy has taken BP Bravo, shouldn't we pull out?\"",
			"\"Withdraw,\" Davis said, \"and go where?\"",
			"A flight of F/A-18s screamed overhead, flying low over Wadi Al Sirree. The aircraft headed west to attack the advancing enemy columns.",
			"\"Sir, I've picked up some transmissions on the artillery net,\" Ser- geant Mark reported. \"All the long-range stuff is engaging the en- emy. We'll be in battle with the main force soon.\"",
			"The sound of outgoing 155mm artillery shells punctuated Mark's words. The rounds arced high overhead and exploded to the west, detonating with a rumble that shook the ground in Wadi Al Sirree. A pair of F/A-18s roared across the sky to the north, dropping cluster bombs on the advancing enemy armor.",
			"\"We're staying,\" Davis said to Piper, with a finality that ended all discussion. \"That's our stuff firing now. The brigade is fight- ing its deep operation. Maybe our air support can even the odds a bit.\"",
			"Deep operations are actions against enemy forces not yet in contact with friendly forces. Deep operations prevent the enemy from massing, and they create opportunities for offensive action by the defender. A deep operation enables the defender to sepa- rate the attacking echelons; disrupt the attacker's command and control, combat support and combat service support; and slow the arrival times of succeeding echelons. Battalions may participate in deep operations in accordance with brigade or division plans.",
			"FM 7-20, The Infantry Battalion, 6 April 1992",
			"\"OK, why not?\" Piper replied, nodding to Davis. \"I guess this is as good a place as any to fight. We're ready.\"",
			"The sound of multiple explosions resonated from the area beyond the jagged ridge to the northwest.",
			"\"That's our stuff,\" Davis shouted to his men, hoping to bolster their confidence. \"Get ready. Enemy armored vehicles will be here in about twenty minutes.\"",
			"\"Well, I better get back to my position,\" Piper said with a deter- mined grin. \"I'll see you when this is all over.\"",
			"\"You can count on it,\" Davis beamed back.",
			"Piper rushed back to his foxhole. Davis focused his binoculars on the exits of the jagged ridge eight kilometers to the northeast. The passes were filled with dust and smoke. Aircraft darted over the ridge, launching their missiles at targets that Davis couldn't see. Suddenly, dark objects began racing out of each pass. Scores of ve- hicles, moving in high-speed columns, emerged from the passes. The vehicles quickly exited the narrow defiles and raced east across the broken desert terrain.",
			"\"There they are,\" Davis declared, pointing to the distant ridge. Ser- geant Mark gave Davis a worried look, then put the receiver back to his ear and continued eavesdropping on the artillery radio frequency.",
			"The rumble of explosions increased. The detonations sounded like the strike of a huge hammer, pounding the earth to the northwest. Davis watched with silent satisfaction as one of the lead enemy col- umns was blanketed with the impact of cluster bombs and 155mm artillery shells. A number of vehicles in this column lurched to a halt and burst into flames. More vehicles, however, bypassed the wreck- age and continued on their determined path to the east.",
			"American planes darted above the advancing enemy formations. A volley of antiaircraft missiles greeted the attacking aircraft, and a fi- ery explosion registered the midair destruction of one of the F/A-18s. Several other aircraft, having already dropped their ordnance, ignited their afterburners and roared back to the east, attempting to outrun the enemy's effective missile defenses.",
			"The sound of outgoing artillery shells suddenly died away. The battlefield grew ominously quiet. Our deep operation is over, Davis thought. Now it's the enemy's turn.",
			"\"That's it, sir,' Mark announced, the radio receiver still pressed against his ear. \"The F/A-18s are heading home. We may get some A-10s later. We can call for fire whenever we have a formation of armored vehicles to shoot at.\"",
			"Tense seconds ticked by. Every man faced to the west, watching the approaching enemy columns. The sound of bursting artillery, pounding a steady path from west to east, interrupted this short inter- lude of quiet. The explosions moved with precision in an inexorable wall of exploding steel toward the American positions. The detonations grew louder. Balls of orange flame erupted in front of the tank ditch. The earth shook under the thunder of the enemy's 152mm guns. The bursting artillery shells showered the American positions with rocks and dirt.",
			"\"Shit, here it comes!\" Cowper screamed. \"Oh my God!\"",
			"The earth in front of the tank ditch exploded in fire and smoke."
        ],
        "offensive_units": {},
        "defensive_units": {
			"d0": {"name": "Platoon HQ", "icon": "0-circle", "rank_icon": "star"}
		},
		"neutrals": {
			"defend_objective": {"name": "Defending Objective", "icon": "shield-fill-exclamation", "color": "blue"}
		},
        "offensive_color": "red",
        "defensive_color": "blue",
        "script": [
			{
				"d0": [430, 326, 35.0, "hold"], "defend_objective": [367, 105, null, "blink"]}
		],
        "choices": [
            [50, "result_die"],
            [50, "result_survive"]
        ]
}