{
        "scenario_type": "static",
        "narration": [
			"<h1 class=\"text-center\"> Captured </h1>",
			"The ground exploded twenty feet in front of Davis.",
			"This is it, Davis thought. I'm not going to make it.",
			"The next shell landed right on top of the young lieutenant. The incoming round exploded. In a flash of fire and steel Davis was thrown through the air.",
			"When Davis finally opened his eyes, he was covered with blood. It took a few moments for him to realize that he was still among the living.",
			"As Davis began to move his limbs, he discovered that his legs were broken. He recoiled in pain. Flies buzzed everywhere. Davis was numb and sick. His mouth had a coppery red-blood taste. He couldn't move his legs. He looked around his position and saw the body of an American soldier several feet to his left. At first he couldn't tell who it was. The body didn't have a head. Then he saw the radio on the corpse's back and realized that it must be Cowper.",
			"Davis couldn't seem to focus his eyes. He saw people walking around him. Someone was shouting.",
			"He waved his right hand. \"Help me!\"",
			"In seconds he was surrounded by enemy soldiers. They pulled at him, took his watch and wallet, and kicked him when he wouldn't respond to their commands to get up. Davis recoiled from the blows, using his right arm to guard his face.",
			"Suddenly the kicking stopped. He was so numb now he couldn't even feel the pain. Finally, someone sounding very official barked commands in Arabic. Hands reached down and jerked Davis up. He screamed in pain.",
			"The next thing he knew he was lying in the back of a truck, bounc- ing down a rough desert trail. A mean-looking guard, brandishing an AK-74 assault rifle, sat near the tailgate of the truck. The guard's eyes were filled with hatred as he stared at Davis.",
			"Lieutenant Bruce Davis was now a prisoner of war. <b>He had failed in his mission.</b> Every soldier in his platoon was either dead or cap- tured. The enemy had broken through Wadi Al Sirree and driven the Americans to the east.",
			"Davis had three options for the defense of Wadi Al Sirree: defend forward of the trails, inside the trails, or behind the trails. He se- lected to defend forward of the trails, from BP Alamo, which over- looked the antitank ditch. This option engaged the enemy at maxi- mum range and required that 1st Platoon destroy the enemy as he crossed the antitank ditch. To increase the strength of this defense, he reinforced the antitank ditch with wire obstacles and minefields.",
			"<blockquote>Defiles limit the area for maneuver and combat; they favor the placing of obstacles and hindrances . . . The defense of a defile can be executed either [1] in front of, or [2] within, or [3] behind the defile. The main battle field is chosen in front of the defile when the defile must be held open for following forces. Truppenfuhrung, German Field Service Regulations, 1933</blockquote>",
			"The greatest weakness of the BP Alamo position was that the de- fense was linear and placed the entire platoon within the range of all the attacker's weapons. Field Marshal Erwin Rommel once said, \"It is easy to break a line.\" The disadvantage of a linear defense is that the enemy can mass superior combat power and break the de- fense at any single point. Fighting a mechanized, armored enemy who possessed superior direct fire capability made the forward- slope battle position defense an impossible task for lightly armed infantrymen.",
			"In addition, Davis failed to conduct a personal reconnaissance of the battlefield from the enemy's point of view. Another quote from the 1933 German Field Service Regulations, Truppenfuhrung, illus- trates this point: \"If conditions permit, the terrain must be reconnoi- tered also from the hostile point of view.\"",
			"Davis failed to do this. He did not look at his position from the enemy's perspective. His positions were in plain view of the enemy and were easy prey for a determined observation post capable of calling in artillery fires or a skilled gunner in a tank or BMP. Davis underestimated the enemy's firepower, and this error was fatal.",
			"In the final analysis, victory or defeat depends significantly on the leaders' understanding and application of tactics. Sun Tzu, the great Chinese military philosopher, described the essence of tactics in the following words:",
			"If I am able to determine the enemy's dispositions while at the same time conceal my own then I can concentrate while he must divide. And if I concentrate while he divides, I can use my entire strength to attack a fraction of his. There, I will be nu- merically superior. Then, if I am able to use many to strike few at the selected point, those I deal with will be in dire straits.",
			"Davis employed the wrong tactics for this situation. <b>Learn from your mistakes and try again.</b>"
        ],
        "mapless_mode": true
}