{
        "scenario_type": "choice",
		"map_path": "map_valley_terrain.png",
        "size": [600, 600],
        "narration": [
			"\"Negative. We don't need to. I can see fine from here,\" Davis said, trying to take charge of the situation. He unfolded his map and beck- oned for the platoon sergeant to bend down as he pointed out key terrain features on the map. \"Besides, I need the time to complete the artillery plan with Sergeant Mark.\"",
			"Piper, his mouth full of chewing tobacco, spat a thin, dark brown string into the dust. \"OK,\" he said. \"I'll get the men to work on the minefields.\"",
			"The platoon continued working. Davis and Sergeant Mark finished their artillery plan. Minefields M1 and M2 were completed on the flanks of the tank ditch. Wire was strung along the west side of the ditch to keep the enemy infantry and sappers out of the obstacle. Piper sighted the machine guns and Javelins of the headquarters sec- tion. The rest of the platoon continued to dig and improve their fight- ing positions. Piper kept the platoon working throughout the day, Squeezing every minute of preparation out of the available time.",
			"Night arrived in slow, colorful stages. First the sun glowed or- ange-red as it sank over the horizon. Then the shimmering heat of the day was suddenly cooled by a comfortable breeze. The western horizon became gorgeous hues of orange, red, and yellow. For a mo- ment, Davis forgot about the task at hand. He sat in awe and marveled at the beauty of the celestial spectacle playing out before him. Then his thoughts turned to preparations for the battle that lay ahead.",
			"The BP was almost complete except for the requirement for over- head cover on the top of each fighting position. Davis hoped that the company XO, First Lieutenant Sandburg, would come through with the building materials he had promised at the company operations order meeting.",
			"Davis contemplated his combat power. He had a total of thirty- eight men, including two Javelin gunners with their ammunition bearers, two M60 machine gunners and their ammunition bearers, and his two-man forward observer team. That left twenty-eight other men to fire AT4 antitank rockets, squad automatic weapons, and M16 rifles. That was all he had. He hoped that it would be enough.",
			"The moon shone brightly, making the hard work of laying wire and placing antitank mines a little easier. The desert was an eerie scene in the bright moonlight, a world of half-lit shadows. After a while, Davis discovered that he could operate in the dim light almost as well as in the day. More importantly, it was much cooler.",
			"Around midnight, the noise of artillery became more discernible. Sporadic cannon fire pounded the ground far to the west.",
			"Davis observed the quiet desert night with his night-vision- goggles. The company radio net was filled with routine reports, in- terrupted by a few intelligence updates from battalion that were passed over the command net by the company XO.",
			"Sometime after midnight Davis settled into his position, hoping for a few minutes' rest. He had pushed himself and his men hard in the hot desert sun. More than anything, he looked forward to a few hours' sleep. With Cowper pulling guard, he leaned back in his fight- ing position and quickly dozed off.",
			"\"Sir, it's Sergeant Mizogouchi on the radio,\" Cowper said in a zombielike voice as he shook his lieutenant.",
			"Davis twitched, surprised out of his sleep. Slowly he gained his senses and grabbed the radio handset from Cowper.",
			"\"One-Six, this is One-Three. Over,\" Mizogouchi called on a squad radio to the platoon leader.",
			"\"This is One-Six. Send it. Over,\" Davis replied.",
			"\"I hear an engine. I can't see a vehicle, but I hear it,\" Mizogouchi reported.",
			"\"Roger. It could be a friendly allied armored car. They're sup- posed to be in front of us to the west. Keep observing and call me as soon as you can determine a location.\"",
			"\"Roger, One-Six.\"",
			"Tense, quiet minutes ticked by into hours. Everyone strained to observe the phantom enemy that Mizogouchi had reported. No one saw or heard anything, and no other action was reported.",
			"If that was an enemy reconnaissance vehicle, Davis reflected, he certainly was careful not to blunder into our positions. Could he know where our positions are? Do they have someone watching us? How else could he have avoided being seen? Hell, what am I saying? It was probably Mizogouchi's imagination.",
			"Davis checked his watch and waited, searching to the west for any indication of the enemy. The night passed slowly. He had always been told that the hardest part of any battle was the waiting. Now he realized that it wasn't so much the waiting as it was the thinking. Your mind plays out all your fears when you're sitting in a foxhole, thousands of miles from home, peering out at the dark. Nerves quickly get on edge as you expect to be in mortal combat at any second.",
			"Am I sure that my men can stop the enemy from infiltrating our positions? Davis thought. Can I block the enemy in Wadi Al Sirree if he decides to attack down Axis Cobra? Have I put up enough mines and wire?",
			"A thousand questions circulated in his head. He looked at his watch. It was now 0340. He lay down with the receiver pressed to his ear.",
			"* * *",
			"\"Wake up, Lieutenant,\" Sergeant Piper said as he nudged his pla- toon leader.",
			"\"Huh? What the hell?\" Davis mumbled, groggy from lack of sleep. He was sitting in his two-man fighting position with a poncho liner pulled over his body.",
			"\"Sir, it's already 0630. Time to inspect our positions,\" Piper re- plied, dropping a brown MRE ration into his platoon leader's fox- hole. \"You must have nodded off right before stand-to.\"",
			"\"Shit! Sergeant, why didn't you get me up?\" Davis protested feebly.",
			"\"Don't worry, sir. I reported to the commander on time. Everything is going fine. You worked your butt off last night. You needed a couple of extra hours' sleep. We'll all need it tomorrow if the enemy attacks.\"",
			"Davis rubbed his tired eyes and then reached for the MRE that the sergeant had thrown at his feet. Now that it was daylight he would have to double-check each position.",
			"\"What about Mizogouchi's report of an enemy vehicle last night?\" asked Davis.",
			"\"We didn't have any other reports all night,\" Piper reported. \"Lieutenant, he never saw anything, he just thought he heard some- thing. Noise carries far in the desert at night. It was probably a case of the first battle nerves.\"",
			"Davis opened his MRE and surveyed the contents. \"Corned beef hash again,\" he complained.",
			"\"You never had it so good!\" Piper said with a devilish grin. \"By the way, while you were sleeping the battalion destroyed a BRDM in the north. It got all the way into the tank battalion sector before it was knocked out.\"",
			"\"Damn. That's pretty good reconnaissance. How did they get by our entire battalion?\" Davis said, finally gaining full consciousness.",
			"\"Don't know. Maybe we weren't looking for the obvious. Maybe they came straight down the road,\" Piper mused. \"The latest intel from battalion is that the enemy overran an allied reconnaissance company that was screening to the west about forty klicks from here. Things may get pretty exciting very soon.\"",
			"\"So, did our allies fight or did they just turn tail?\" Davis asked.",
			"\"They fought,\" Piper replied, spitting a wad of chewing tobacco juice on the dust. \"The XO came by while you were sleeping and dropped off thirty corrugated steel sheets, twenty antitank mines, about six hundred sandbags, ten additional AT4s, and thirty-five gal- lons of water.\"",
			"\"I'1] never say another bad thing about company headquarters,\" Davis said with a smile.",
			"\"Guess what else the XO told me.\"",
			"Davis shrugged his shoulders. \"We're all going on R and R in Bahrain in the next two hours?\"",
			"\"Shit, Lieutenant, get real,\" Piper said with a smirk. \"Bludgell named our position here BP Alamo.\"",
			"\"Alamo?\" Davis said, looking up at the sergeant as he swallowed a spoonful of cold corned beef hash. \"Is that supposed to be funny?\"",
			"This time Piper shrugged. \"You know the CO. He's from Texas. Don't ask me how his mind works.\"",
			"Davis looked over at Sergeant Mark and the two RTOs. They were sprawled on the ground, their poncho liners covering them, sound asleep. Cowper slept on his side, with his precious radio near his chest.",
			"\"The men are beat, sir,\" Piper protested, anticipating Davis's need to act. \"Tired soldiers won't fight well.\"",
			"Davis knew that the soldiers were tired. Conservation of their strength was critical.",
			"\"I recommend we let everyone catch a little sleep. We're ahead of schedule. The war can wait.\" The muffled rumble of distant explo- sions could be heard way off to the west.",
			"\"Hey, Sergeant, I'm tired, too.\"",
			"Sir, if you don't give these men a few hours' rest, there may not be anyone awake to defend this position tonight.\"",
			"Davis looked at his watch. The cumulative effect of hard work, heat, and fear had worn the men ragged. Davis knew that <b>his men needed rest</b>. Maybe Piper was right.",
			"Davis has to decide!"
        ],
        "offensive_units": {
		},
        "defensive_units": {
			"d1": {"name": "Defend squad 1", "icon": "1-circle"}, 
			"d2": {"name": "Defend squad 2", "icon": "2-circle"}, 
			"d3": {"name": "Defend squad 3", "icon": "3-circle"}, 
			"d4": {"name": "Defend squad 4", "icon": "4-circle"}, 
			"d0": {"name": "Platoon HQ", "icon": "0-circle", "rank_icon": "star"}
		},
		"neutrals": {
			"defend_objective": {"name": "Defending Objective", "icon": "shield-fill-exclamation", "color": "blue"},
			"mine_m1": {"name": "Minefield M1", "icon": "dash-square-dotted", "color": "green"},
			"mine_m2": {"name": "Minefield M2", "icon": "dash-square-dotted", "color": "green"},
			"mine_m3": {"name": "Minefield M3", "icon": "dash-square-dotted", "color": "green"},
			"mine_m4": {"name": "Minefield M4", "icon": "dash-square-dotted", "color": "green"}
		},
        "offensive_color": "red",
        "defensive_color": "blue",
        "script": {
            "initial":
                [
					{"d1": [361, 385, 100.0, "working"], "d2": [407, 367, 100.0, "working"], "d3": [494, 348, 100.0, "working"], "d4": [551, 312, 35.0, "working"], "d0": [430, 326, 35.0, "working"], 
					"defend_objective": [367, 105, null, "blink"], "hill_865": [291, 300, null, "active"], "mine_m1": [297, 429, null, "working"], "mine_m2": [374, 424, null, "working"], "mine_m3": [436, 419, null, "working"], "mine_m4": [557, 349, null, "working"]},
					{"d0": [430, 326, 35.0, "planning"]}
				],
            "choice_rest": 
                [
					{"d0": [430, 326, 35.0, "approve"]},
					{"d1": [361, 385, 100.0, "rest"], "d2": [407, 367, 100.0, "rest"], "d3": [494, 348, 100.0, "rest"], "d4": [551, 312, 35.0, "rest"], "d0": [430, 326, 35.0, "rest"]},
					{},
					{},
					{"d1": [361, 385, 100.0, "working"], "d2": [407, 367, 100.0, "working"], "d3": [494, 348, 100.0, "working"], "d4": [551, 312, 35.0, "working"], "d0": [430, 326, 35.0, "working"]}
                ],
            "choice_keep_working": 
                [
					
					{"d0": [430, 326, 35.0, "disapprove"]},
					{"d1": [361, 385, 100.0, "working"], "d2": [407, 367, 100.0, "working"], "d3": [494, 348, 100.0, "working"], "d4": [551, 312, 35.0, "working"], "d0": [430, 326, 35.0, "working"]},
					{"d1": [361, 385, 100.0, "working"], "d2": [407, 367, 100.0, "working"], "d3": [494, 348, 100.0, "working"], "d4": [551, 312, 35.0, "working"], "d0": [430, 326, 35.0, "working"]},
					{"d1": [361, 385, 100.0, "working"], "d2": [407, 367, 100.0, "working"], "d3": [494, 348, 100.0, "working"], "d4": [551, 312, 35.0, "working"], "d0": [430, 326, 35.0, "working"]}
                ]
        },
        "choices": {
            "choice_rest": "Allow rest",
            "choice_keep_working": "Keep working"
        }
}